resource/request_file/LERP_CS_PersonalAccident.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:cheq="http://schemas.datacontract.org/2004/07/ChequeSubmissionDetailPushFromIDToSS">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:SaveHealthDetails>
            <!--Optional:-->
            <tem:PersonalTitle>___salutation_text___</tem:PersonalTitle>
            <!--Optional:-->
            <tem:ClientName>___contact_name___</tem:ClientName>
            <!--Optional:-->
            <tem:HolderAddress>___communication_address_1___ ___communication_address_2___ ___communication_address_3___</tem:HolderAddress>
            <!--Optional:-->
            <tem:HolderCity>___communication_city___</tem:HolderCity>
            <!--Optional:-->
            <tem:HolderPincode>___communication_pincode___</tem:HolderPincode>
            <!--Optional:-->
            <tem:PhoneO>___mobile___</tem:PhoneO>
            <!--Optional:-->
            <tem:PhoneR>___mobile___</tem:PhoneR>
            <!--Optional:-->
            <tem:Mobile>___mobile___</tem:Mobile>
            <!--Optional:-->
            <tem:EMail>___email___</tem:EMail>
            <!--Optional:-->
            <tem:Nominee>___nominee_first_name___ ___nominee_middle_name___ ___nominee_last_name___</tem:Nominee>
            <!--Optional:-->
            <tem:NomineeRelation>___nominee_relation_text___</tem:NomineeRelation>
            <!--Optional:-->
            <tem:nomineeAge>___nominee_age___</tem:nomineeAge>
            <!--Optional:-->
            <tem:ContactPerson>___contact_name___</tem:ContactPerson>
            <!--Optional:-->
            <tem:ContactNo>___mobile___</tem:ContactNo>
            <!--Optional:-->
            <tem:GST/>
            <!--Optional:-->
            <tem:PANNO>___pan___</tem:PANNO>
            <!--Optional:-->
            <tem:AadharNo/>
            <!--Optional:-->
            <tem:ClientType>Individual</tem:ClientType>
            <!--Optional:-->
            <tem:Designation/>
            <!--Optional:-->
            <tem:Region>___posp_agent_city___</tem:Region>
            <!--Optional:-->
            <tem:Source>___erp_source___</tem:Source>
            <!--Optional:-->
            <tem:BusinessGroup>LANDMARK</tem:BusinessGroup>
            <!--Optional:-->
            <tem:CaseType>LandMark</tem:CaseType>
            <!--Optional:-->
            <tem:ProductName>___erp_product_name___</tem:ProductName>
            <!--Optional:-->
            <tem:PolicyCategory>___pa_insurance_type___</tem:PolicyCategory>
            <!--Optional:-->
            <tem:BussClass>___erp_plan_name___</tem:BussClass>
            <!--Optional:-->
            <tem:InceptionDate>___policy_start_date___</tem:InceptionDate>
            <!--Optional:-->
            <tem:ExpiryDate>___policy_end_date___</tem:ExpiryDate>
            <!--Optional:-->
            <tem:POSPId>___posp_erp_id___</tem:POSPId><!--___posp_first_name___ ___posp_last_name___-->
            <!--Optional:-->
            <tem:Executive1>___posp_reporting_agent_uid___</tem:Executive1><!--___posp_reporting_agent_name___-->
            <!--Optional:-->
            <tem:Executive2/>
            <!--Optional:-->
            <tem:InsCompany>___insurerco_name___</tem:InsCompany>
            <!--Optional:-->
            <tem:BusinessLockAt>Mumbai</tem:BusinessLockAt>
            <!--Optional:-->
            <tem:Premium>___premium_breakup_final_premium___</tem:Premium>
            <!--Optional:-->
            <tem:SumInsured>___pa_insurance_si___</tem:SumInsured><!--doubt-->
            <!--Optional:-->
            <tem:ChqForwardingDate>___current_date___</tem:ChqForwardingDate>
            <!--Optional:-->
            <tem:PolicyIsseudate>___current_date___</tem:PolicyIsseudate>
            <!--Optional:-->
            <tem:PolicyNo>___pg_policy_number___</tem:PolicyNo><!--doubt-->
            <!--Optional:-->
            <tem:ProposalNo>___pg_transaction_id___</tem:ProposalNo>
            <!--Optional:-->
            <tem:MedicalReq/>
            <!--Optional:-->
            <tem:Remarks>___remarks___</tem:Remarks>
            <!--Optional:-->
            <tem:ChqMode>NEFT</tem:ChqMode>
            <!--Optional:-->
            <tem:ChqDate>___current_date___</tem:ChqDate>
            <!--Optional:-->
            <tem:CustBankName></tem:CustBankName>
            <!--Optional:-->
            <tem:ChqNo></tem:ChqNo><!--doubt-->
            <!--Optional:-->
            <tem:InFavourOf></tem:InFavourOf>
            <!--Optional:-->
            <tem:ChqAmount>___premium_breakup_final_premium___</tem:ChqAmount>
            <tem:ODPremium>___premium_breakup_net_premium___</tem:ODPremium>
            <!--Optional:-->
            <tem:Terrorism>0</tem:Terrorism>
            <!--Optional:-->
            <tem:StampDuty>0</tem:StampDuty>
            <!--Optional:-->
            <tem:Other>___tp_other___</tem:Other>
            <!--Optional:-->
            <tem:AddOnPremium>0</tem:AddOnPremium>
            <!--Optional:-->
            <tem:STax>18</tem:STax>
            <!--Optional:-->
            <tem:ServiceTax>___service_tax___</tem:ServiceTax>
            <!--Optional:-->
            <tem:POSPMode>ONLINE</tem:POSPMode>
            <!--Optional:-->
            <tem:IsPosp>NONPOSP</tem:IsPosp>
            <!--Optional:-->
            <tem:POSPCategory>___posp_category___</tem:POSPCategory>
            <!--Optional:-->
            <tem:POSPCode/>
            <!--Optional:-->
            <tem:POSPSourceId>___posp_sources___</tem:POSPSourceId>
            <!--Optional:-->
            <tem:NomineeDOB>___nominee_birth_date___</tem:NomineeDOB>
            <!--Optional:-->
            <tem:HelPremiumPayingTerm>0</tem:HelPremiumPayingTerm>
            <!--Optional:-->
            <tem:HelPremiumPayingTermAge>0</tem:HelPremiumPayingTermAge>
            <!--Optional:-->
            <tem:HelPremiumMode>0</tem:HelPremiumMode>
            <!--Optional:-->
            <tem:HelWRP>0</tem:HelWRP>
            <!--Optional:-->
            <tem:HelWAPI>0</tem:HelWAPI>
            <!--Optional:-->
            <tem:HelTotalprm>0</tem:HelTotalprm>
            <!--Optional:-->
            <tem:HelEcsDate/>
            <!--Optional:-->
            <tem:HelInstallmentstatus>true</tem:HelInstallmentstatus>
            <!--Optional:-->
            <tem:ProposalType>1</tem:ProposalType>
            <!--Optional:-->
            <tem:HelMandate>0</tem:HelMandate>
            <!--Optional:-->
            <tem:PospProduct>___erp_posp_product___</tem:PospProduct>
            <!--Optional:-->
            <tem:InsuredDetails>
                <!--Zero or more repetitions:-->
                <!--InsurersDetail_Start-->
                <cheq:InsuredDetails>
                    <!--Optional:-->
                    <cheq:AnyMedicine>Not Now</cheq:AnyMedicine>
                    <!--Optional:-->
                    <cheq:BloodPressure>false</cheq:BloodPressure>
                    <!--Optional:-->
                    <cheq:DOB>___member_array_birth_date___</cheq:DOB>
                    <!--Optional:-->
                    <cheq:Diabetes>false</cheq:Diabetes>
                    <!--Optional:-->
                    <cheq:Gender>___member_array_gender___</cheq:Gender>
                    <!--Optional:-->
                    <cheq:Height>___member_array_height___</cheq:Height>
                    <!--Optional:-->
                    <cheq:InsuredName>___member_array_first_name___ ___member_array_middle_name___ ___member_array_last_name___</cheq:InsuredName>
                    <!--Optional:-->
                    <cheq:Mesurment>Centimeter</cheq:Mesurment>
                    <!--Optional:-->
                    <cheq:Operation>false</cheq:Operation>
                    <!--Optional:-->
                    <cheq:Portability>false</cheq:Portability>
                    <!--Optional:-->
                    <cheq:Relation>___member_array_relation___</cheq:Relation>
                    <!--Optional:-->
                    <cheq:Weight>___member_array_weight___</cheq:Weight>
                </cheq:InsuredDetails>
                <!--InsurersDetail_End-->
            </tem:InsuredDetails>
            <!--Optional:-->
            <tem:FinAppId>___posp_fba_id___</tem:FinAppId>
            <!--Optional:-->
            <tem:QT/>
            <!--Optional:-->
            <tem:BirthDate>___birth_date___</tem:BirthDate>
            <!--Optional:-->
            <tem:IsCasePOSP>0</tem:IsCasePOSP>
            <tem:Elite>___elite_flag___</tem:Elite>
            <tem:PB_SSID>___ss_id___</tem:PB_SSID>
            <tem:PB_CRN>___crn___</tem:PB_CRN>
            <GetWhatsAppUpdates>___is_whatsapp_allow___</GetWhatsAppUpdates>
            <WhatsAppNo>___whatsapp_mobile___</WhatsAppNo>
        </tem:SaveHealthDetails>
    </soapenv:Body>
</soapenv:Envelope>